  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/bastion-vault` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/fd29b3d2-1599-4d65-978a-755b0127c9ef/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.eastus["eastus"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.0.0.0/28",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus"
  }

# module.eastus["eastus"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "azure-eastus"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.eastus["westus"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.1.0.0/28",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus"
  }

# module.eastus["westus"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.1.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus"
    + name                = "azure-westus"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>